AREA_CODE_CHOICES = [
    ('+1', '🇺🇸 +1'),  # United States
    ('+1', '🇨🇦 +1'),  # Canada
    ('+44', '🇬🇧 +44'),  # United Kingdom
    ('+33', '🇫🇷 +33'),  # France
    ('+49', '🇩🇪 +49'),  # Germany
    ('+34', '🇪🇸 +34'),  # Spain
    ('+39', '🇮🇹 +39'),  # Italy
    ('+81', '🇯🇵 +81'),  # Japan
    ('+82', '🇰🇷 +82'),  # South Korea
    ('+91', '🇮🇳 +91'),  # India
    ('+86', '🇨🇳 +86'),  # China
    ('+55', '🇧🇷 +55'),  # Brazil
    ('+61', '🇦🇺 +61'),  # Australia
    ('+7', '🇷🇺 +7'),  # Russia
    ('+27', '🇿🇦 +27'),  # South Africa
    ('+52', '🇲🇽 +52'),  # Mexico
    ('+64', '🇳🇿 +64'),  # New Zealand
    ('+20', '🇪🇬 +20'),  # Egypt
    ('+62', '🇮🇩 +62'),  # Indonesia
    ('+60', '🇲🇾 +60'),  # Malaysia
    ('+65', '🇸🇬 +65'),  # Singapore
    ('+966', '🇸🇦 +966'),  # Saudi Arabia
    ('+971', '🇦🇪 +971'),  # United Arab Emirates
]